УТ_для_edt/src/Documents/смартASP_БонусыЗаРемонтныеРаботы/смартASP_БонусыЗаРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартASP_БонусыЗаРемонтныеРаботы</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <registerRecords>AccumulationRegister.смартASP_НакоплениеБонусов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднийКурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОборота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусРасчетаБонусов</name>
    <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
    <type>
      <types>EnumRef.смартСтатусыДокументовРасчетаБонусов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачислениеБонусов</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Представительство</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГарантийныхРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлатныхРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаГарантийныеРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаПлатныеРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеНачисленияБонуса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/смартASP_БонусыЗаРемонтныеРаботы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.смартASP_БонусыЗаРемонтныеРаботы.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартASP_БонусыЗаРемонтныеРаботы.Дата КАК Дата,
	|	смартASP_БонусыЗаРемонтныеРаботы.Номер КАК Номер,
	|	смартASP_БонусыЗаРемонтныеРаботы.СуммаОборота КАК СуммаОборота,
	|	смартASP_БонусыЗаРемонтныеРаботы.НачислениеБонусов.(
	|		Представительство КАК Представительство,
	|		СУММА(КоличествоГарантийныхРабот) КАК КоличествоГарантийныхРабот,
	|		СУММА(КоличествоПлатныхРабот) КАК КоличествоПлатныхРабот,
	|		СУММА(СуммаЗаГарантийныеРаботы) КАК СуммаЗаГарантийныеРаботы,
	|		СУММА(СуммаЗаПлатныеРаботы) КАК СуммаЗаПлатныеРаботы,
	|		СУММА(СуммаКВыплате) КАК СуммаКВыплате
	|	) КАК НачислениеБонусов
	|ИЗ
	|	Документ.смартASP_БонусыЗаРемонтныеРаботы КАК смартASP_БонусыЗаРемонтныеРаботы
	|ГДЕ
	|	смартASP_БонусыЗаРемонтныеРаботы.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	смартASP_БонусыЗаРемонтныеРаботы.НачислениеБонусов.(Представительство)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНачислениеБонусовШапка = Макет.ПолучитьОбласть("НачислениеБонусовШапка");
	ОбластьНачислениеБонусов = Макет.ПолучитьОбласть("НачислениеБонусов");
	ОбластьНачисленияБонусовИтоги=Макет.ПолучитьОбласть("НачислениеИтоги");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНачислениеБонусовШапка);
		ВыборкаНачислениеБонусов = Выборка.НачислениеБонусов.Выбрать();
		Пока ВыборкаНачислениеБонусов.Следующий() Цикл
			ОбластьНачислениеБонусов.Параметры.Заполнить(ВыборкаНачислениеБонусов);
			ТабДок.Вывести(ОбластьНачислениеБонусов, ВыборкаНачислениеБонусов.Уровень());
		КонецЦикла; 
		//ТЗРЕз=Запрос.Выполнить().Выгрузить();
		//ОбластьНачисленияБонусовИтоги.Параметры.Заполнить(ТЗРез);
		//ТабДок.Вывести(ОбластьНачисленияБонусовИтоги);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
//--#1288 смарт: Лопато 26.12.2022

#КонецЕсли
